# Programación para Análisis de datos
## Práctica 4: Pandas
 


<b>Nota:</b>
Esta practica esta basada en los ejercicios de varios recursos online como:

* https://github.com/ajcr/100-pandas-puzzles/blob/master/100-pandas-puzzles.ipynb
* https://www.machinelearningplus.com/python/101-pandas-exercises-python/
* https://www.kaggle.com/learn/pandas
* https://github.com/facuzeta/pandas_exercises
* https://github.com/guipsamora/pandas_exercises


<b>Indice:</b>

1. [Extracción de datos](#Extraer-datos:-Restaurant)
2. [Filtrar datos](#Filtrar-datos)
3. [GroupBy](#GroupBy)
4. [Apply](#Apply:-Student-Alcohol-Consumption)
5. [Merge](#Merge:-Housing-Market)
6. [Stats](#Stats:-US---Baby-Names)
7. [Deleting](#Deleting:-Iris)
8. [Bonus](#lab#Bonus:)

# Extraer datos: Restaurant
Referencias:
* [Read_csv](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)
* [Group by](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html)
* [dtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dtypes.html)

1. Import the necessary libraries

In [1]:
import pandas as pd

2. Import the dataset from this [address](https://facuzeta.github.io/udesa/01_programacion/guias/datasets/chipotle.tsv).

In [9]:
pd.read_csv('chipotle.tsv', sep='\t', index_col= 'order_id')

,quantity,item_name,choice_description,item_price
order_id,,,,
1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,Izze,[Clementine],$3.39
1,1,Nantucket Nectar,[Apple],$3.39
1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...
1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

3. Assign it to a variable called chipo.

In [10]:
chibo = pd.read_csv('chipotle.tsv', sep='\t', index_col= 'order_id')

4. See the first 10 entries

In [11]:
chibo.head()

,quantity,item_name,choice_description,item_price
order_id,,,,
1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,Izze,[Clementine],$3.39
1,1,Nantucket Nectar,[Apple],$3.39
1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

5. What is the number of observations in the dataset?

In [12]:
chibo.shape[0]

4622

6. What is the number of columns in the dataset?

In [13]:
chibo.shape[1]

4

7. Print the name of all the columns.

In [14]:
chibo.columns

Index(['quantity', 'item_name', 'choice_description', 'item_price'], dtype='object')

9. Which was the most-ordered item?

In [34]:
chibo.sort_values('quantity', ascending = False)['item_name'].head(1).values

array(['Chips and Fresh Tomato Salsa'], dtype=object)

10. For the most-ordered item, how many items were ordered?

In [33]:
chibo.sort_values('quantity', ascending = False).head(1)['quantity'].values

array([15])

11. What was the most ordered item in the choice_description column?

In [38]:
chibo.sort_values('quantity', ascending = False).head(1)['choice_description'].values

array([nan], dtype=object)

12. How many items were orderd in total?

In [40]:
chibo.quantity.sum()

4972

13. Turn the item price into a float

13.a. Check the item price type

In [66]:
chibo.head()

,quantity,item_name,choice_description,item_price
order_id,,,,
1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,Izze,[Clementine],$3.39
1,1,Nantucket Nectar,[Apple],$3.39
1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [70]:
sin_peso = chibo.item_price.apply(lambda x: str(x).strip('$'))

13.b. Change the type of the column into a float

In [73]:
chibo['item_price'] = sin_peso
chibo['item_price'] = chibo['item_price'].astype(float)

13.c. Check the item price type

In [74]:
chibo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4622 entries, 1 to 1834
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   quantity            4622 non-null   int64
 1   item_name           4622 non-null   object
 2   choice_description  3376 non-null   object
 3   item_price          4622 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 340.5+ KB

14. How much was the revenue for the period in the dataset?

In [77]:
chibo['revenue']=chibo.quantity*chibo.item_price
chibo.revenue.sum()

39237.02

15. How many orders were made in the period?

In [79]:
chibo.quantity.sum()

4972

16. What is the average revenue amount per order?

In [85]:
chibo.groupby('order_id').mean()['revenue'].to_frame()

            revenue
order_id
1          2.890000
2         33.960000
3          6.335000
4         10.500000
5          6.850000
...             ...
1830      11.500000
1831       4.300000
1832       6.600000
1833      11.750000
1834       9.583333

[1834 rows x 1 columns]

17. How many different items are sold?

In [93]:
chibo['item_name'].nunique()

50

18. How many products cost more than $10.00?

In [97]:
chibo[chibo.item_price > 10]['quantity'].count()

1130

## Filtrar datos
Referencias:
* [Reset Index](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html)
* [Sort values](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values)

19. What is the price of each item? 
###### print a data frame with only two columns item_name and item_price

In [99]:
chibo[['item_name', 'item_price']]

                                      item_name  item_price
order_id
1                  Chips and Fresh Tomato Salsa        2.39
1                                          Izze        3.39
1                              Nantucket Nectar        3.39
1         Chips and Tomatillo-Green Chili Salsa        2.39
2                                  Chicken Bowl       16.98
...                                         ...         ...
1833                              Steak Burrito       11.75
1833                              Steak Burrito       11.75
1834                         Chicken Salad Bowl       11.25
1834                         Chicken Salad Bowl        8.75
1834                         Chicken Salad Bowl        8.75

[4622 rows x 2 columns]

20. Sort by the name of the item

In [101]:
chibo.sort_values('item_name')

,quantity,item_name,choice_description,item_price,revenue
order_id,,,,,
1360,2,6 Pack Soft Drink,[Diet Coke],12.98,25.96
148,1,6 Pack Soft Drink,[Diet Coke],6.49,6.49
749,1,6 Pack Soft Drink,[Coke],6.49,6.49
754,1,6 Pack Soft Drink,[Diet Coke],6.49,6.49
1076,1,6 Pack Soft Drink,[Coke],6.49,6.49
...,...,...,...,...,...
948,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",8.75,8.75
322,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Black Beans, Cheese, Sou...",8.75,8.75
1132,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",8.49,8.49
688,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25,11.25
567,1,Veggie Soft Tacos,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...",8.49,8.49

21. What was the quantity of the most expensive item ordered?

In [108]:
chibo.sort_values('item_price', ascending = False)[['quantity', 'item_name']][:1]

          quantity                     item_name
order_id
1443            15  Chips and Fresh Tomato Salsa

22. How many times was a Veggie Salad Bowl ordered?

In [114]:
chibo[chibo.item_name.str.contains('Veggie Salad Bowl')]['quantity'].sum()

18

23. How many times did someone order more than one Canned Soda?

In [122]:
chibo[(chibo.item_name=='Canned Soda') & (chibo.quantity > 1)].count()['quantity']

20

## GroupBy

Referencias:
* [Describe](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html)

GroupBy can be summarized as Split-Apply-Combine. Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)

24. Import the dataset from this [address](https://facuzeta.github.io/udesa/01_programacion/guias/datasets/drinks.csv).

25. Assign it to a variable called drinks.

In [126]:
drinks = pd.read_csv('drinks.csv')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

26. Which continent drinks more beer on average?

In [128]:
drinks.groupby('country').agg({'total_litres_of_pure_alcohol':'mean'}).sort_values('total_litres_of_pure_alcohol', ascending = False)

            total_litres_of_pure_alcohol
country
Belarus                             14.4
Lithuania                           12.9
Andorra                             12.4
Grenada                             11.9
France                              11.8
...                                  ...
Maldives                             0.0
Kuwait                               0.0
Iran                                 0.0
Bangladesh                           0.0
Libya                                0.0

[193 rows x 1 columns]

27. Print the mean alcohol consumption per continent for every column

In [130]:
drinks.groupby('country').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
country,,,,
Afghanistan,0,0,0,0.0
Albania,89,132,54,4.9
Algeria,25,0,14,0.7
Andorra,245,138,312,12.4
Angola,217,57,45,5.9
...,...,...,...,...
Venezuela,333,100,3,7.7
Vietnam,111,2,1,2.0
Yemen,6,0,0,0.1
Zambia,32,19,4,2.5
Zimbabwe,64,18,4,4.7

28. Print the median alcohol consumption per continent for every column

In [131]:
drinks.groupby('country').median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
country,,,,
Afghanistan,0,0,0,0.0
Albania,89,132,54,4.9
Algeria,25,0,14,0.7
Andorra,245,138,312,12.4
Angola,217,57,45,5.9
...,...,...,...,...
Venezuela,333,100,3,7.7
Vietnam,111,2,1,2.0
Yemen,6,0,0,0.1
Zambia,32,19,4,2.5
Zimbabwe,64,18,4,4.7

29. Print the mean, min and max values for spirit consumption.

In [133]:
drinks.groupby('country').agg({'spirit_servings':['mean','min','max']})

            spirit_servings
                       mean  min  max
country
Afghanistan               0    0    0
Albania                 132  132  132
Algeria                   0    0    0
Andorra                 138  138  138
Angola                   57   57   57
...                     ...  ...  ...
Venezuela               100  100  100
Vietnam                   2    2    2
Yemen                     0    0    0
Zambia                   19   19   19
Zimbabwe                 18   18   18

[193 rows x 3 columns]

## Apply: Student Alcohol Consumption
Referencias:
* [apply](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.core.groupby.GroupBy.apply.html?highlight=apply#pandas.core.groupby.GroupBy.apply)

30. Import the dataset from this [address](https://facuzeta.github.io/udesa/01_programacion/guias/datasets/student-mat.csv).

In [134]:
pd.read_csv('student-mat.csv')

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,5,4,4,5,4,11,9,9,9
391,MS,M,17,U,LE3,T,3,1,services,services,...,2,4,5,3,4,2,3,14,16,16
392,MS,M,21,R,GT3,T,1,1,other,other,...,5,5,3,3,3,3,3,10,8,7
393,MS,M,18,R,LE3,T,3,2,services,other,...,4,4,1,3,4,5,0,11,12,10
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,3,2,3,3,3,5,5,8,9,9

31. Assign it to a variable called df.

In [136]:
df = pd.read_csv('student-mat.csv')

df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

32. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [137]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 33 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   school      395 non-null    object
 1   sex         395 non-null    object
 2   age         395 non-null    int64
 3   address     395 non-null    object
 4   famsize     395 non-null    object
 5   Pstatus     395 non-null    object
 6   Medu        395 non-null    int64
 7   Fedu        395 non-null    int64
 8   Mjob        395 non-null    object
 9   Fjob        395 non-null    object
 10  reason      395 non-null    object
 11  guardian    395 non-null    object
 12  traveltime  395 non-null    int64
 13  studytime   395 non-null    int64
 14  failures    395 non-null    int64
 15  schoolsup   395 non-null    object
 16  famsup      395 non-null    object
 17  paid        395 non-null    object
 18  activities  395 non-null    object
 19  nursery     395 non-null    object
 20  higher      395 non-null    object
 21  internet    395 non-null    object
 22  romantic    395 non-null    object
 23  famrel      395 non-null    int64
 24  freetime    395 non-null    int64
 25  goout       395 non-null    int64
 26  Dalc        395 non-null    int64
 27  Walc        395 non-null    int64
 28  health      395 non-null    int64
 29  absences    395 non-null    int64
 30  G1          395 non-null    int64
 31  G2          395 non-null    int64
 32  G3          395 non-null    int64
dtypes: int64(16), object(17)
memory usage: 102.0+ KB

In [139]:
df.iloc[:,0:12]

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother
4,GP,F,16,U,GT3,T,3,3,other,other,home,father
...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,course,other
391,MS,M,17,U,LE3,T,3,1,services,services,course,mother
392,MS,M,21,R,GT3,T,1,1,other,other,course,other
393,MS,M,18,R,LE3,T,3,2,services,other,course,mother
394,MS,M,19,U,LE3,T,1,1,other,at_home,course,father

33. Create a function that will capitalize strings.

In [146]:
df.applymap(lambda x: x.upper() if isinstance(x,str) else x)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,AT_HOME,TEACHER,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,AT_HOME,OTHER,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,AT_HOME,OTHER,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,HEALTH,SERVICES,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,OTHER,OTHER,...,4,3,2,1,2,5,4,6,10,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,SERVICES,SERVICES,...,5,5,4,4,5,4,11,9,9,9
391,MS,M,17,U,LE3,T,3,1,SERVICES,SERVICES,...,2,4,5,3,4,2,3,14,16,16
392,MS,M,21,R,GT3,T,1,1,OTHER,OTHER,...,5,5,3,3,3,3,3,10,8,7
393,MS,M,18,R,LE3,T,3,2,SERVICES,OTHER,...,4,4,1,3,4,5,0,11,12,10
394,MS,M,19,U,LE3,T,1,1,OTHER,AT_HOME,...,3,2,3,3,3,5,5,8,9,9

34. Capitalize both Mjob and Fjob

35. Print the last elements of the data set.

In [147]:
df.tail(1)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,3,2,3,3,3,5,5,8,9,9

36. Create a function called majority that returns a boolean value to a new column called legal_drinker (Consider majority as older than 17 years old)

In [151]:
df['legal_drinker']=(df['age']>17).astype(int)

In [152]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3,legal_drinker
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,3,4,1,1,3,6,5,6,6,1
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,3,3,1,1,3,4,5,5,6,0
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,3,2,2,3,3,10,7,8,10,0
3,GP,F,15,U,GT3,T,4,2,health,services,...,2,2,1,1,5,2,15,14,15,0
4,GP,F,16,U,GT3,T,3,3,other,other,...,3,2,1,2,5,4,6,10,10,0

## Merge: Housing Market
Referencias:
* [randint](https://docs.scipy.org/doc/numpy-1.15.1/reference/generated/numpy.random.randint.html)

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

37. Import the necessary libraries

In [153]:
import numpy as np

38. Create 3 differents Series, each of length 100, as follows: 
<br>
    The first a random number from 1 to 4 
    <br>
    The second a random number from 1 to 3
    <br>
    The third a random number from 10,000 to 30,000

In [158]:
s1 =pd.Series(np.random.randint(1,5,100))
s2 =pd.Series(np.random.randint(1,4,100))
s3 = pd.Series(np.random.randint(10000,30001,100))

39. Let's create a DataFrame by joinning the Series by column

In [161]:
df2 = pd.DataFrame({'s1':s1,"s2":s2,"s3":s3})
df2

    s1  s2     s3
0    1   1  11700
1    3   1  12493
2    1   2  24059
3    1   1  27536
4    3   1  12241
..  ..  ..    ...
95   3   1  11791
96   4   2  13208
97   4   2  28442
98   4   1  22272
99   2   1  19488

[100 rows x 3 columns]

40. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [164]:
df2.columns=['bedrs', 'bathrs', 'price_sqr_meter']

In [165]:
df2

    bedrs  bathrs  price_sqr_meter
0       1       1            11700
1       3       1            12493
2       1       2            24059
3       1       1            27536
4       3       1            12241
..    ...     ...              ...
95      3       1            11791
96      4       2            13208
97      4       2            28442
98      4       1            22272
99      2       1            19488

[100 rows x 3 columns]

41. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

42. Oops, it seems it is going only until index 99. Is it true?

43. Reindex the DataFrame so it goes from 0 to 299

## Stats: US - Baby Names

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014

44. Import the dataset from this [address](https://facuzeta.github.io/udesa/01_programacion/guias/datasets/US_Baby_Names_right.csv.zip).

45. Assign it to a variable called baby_names.

In [186]:
baby_names = pd.read_csv('Data/US_Baby_Names_right.csv')
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

46. See the first 10 entries

In [187]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

47. Delete the column 'Unnamed: 0' and 'Id'

In [188]:
baby_names.drop(['Unnamed: 0','Id'], axis=1, inplace = True)

48. Is there more male or female names in the dataset?

In [189]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

49. Group the dataset by name and assign to names

In [190]:
names=baby_names.groupby('Name')

50. How many different names exist in the dataset?

In [191]:
names=(names['Count'].sum()).to_frame()
names

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6
...        ...
Zyra        42
Zyrah       11
Zyren        6
Zyria       59
Zyriah      58

[17632 rows x 1 columns]

51. What is the name with most occurrences?

In [192]:
names.sort_values('Count', ascending = False)

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

52. How many different names have the least occurrences?

In [193]:
names.sort_values('Count', ascending = False).tail(1)

      Count
Name
Nita      5

53. What is the median name occurrence?

In [198]:
baby_names.groupby('Name')['Count'].mean()

Name
Aaban       6.000000
Aadan       5.750000
Aadarsh     5.000000
Aaden      17.479592
Aadhav      6.000000
             ...
Zyra        6.000000
Zyrah       5.500000
Zyren       6.000000
Zyria       5.900000
Zyriah      6.444444
Name: Count, Length: 17632, dtype: float64

54. What is the standard deviation of names?

In [199]:
baby_names.groupby('Name')['Count'].std()

Name
Aaban       0.000000
Aadan       0.957427
Aadarsh          NaN
Aaden      21.154974
Aadhav           NaN
             ...
Zyra        1.154701
Zyrah       0.707107
Zyren            NaN
Zyria       0.737865
Zyriah      1.666667
Name: Count, Length: 17632, dtype: float64

55. Get a summary with the mean, min, max, std and quartiles.

In [206]:
baby_names.groupby('Name')['Count'].describe()

         count       mean        std  min   25%   50%    75%    max
Name
Aaban      2.0   6.000000   0.000000  6.0  6.00   6.0   6.00    6.0
Aadan      4.0   5.750000   0.957427  5.0  5.00   5.5   6.25    7.0
Aadarsh    1.0   5.000000        NaN  5.0  5.00   5.0   5.00    5.0
Aaden    196.0  17.479592  21.154974  5.0  6.00  10.0  20.00  158.0
Aadhav     1.0   6.000000        NaN  6.0  6.00   6.0   6.00    6.0
...        ...        ...        ...  ...   ...   ...    ...    ...
Zyra       7.0   6.000000   1.154701  5.0  5.00   6.0   6.50    8.0
Zyrah      2.0   5.500000   0.707107  5.0  5.25   5.5   5.75    6.0
Zyren      1.0   6.000000        NaN  6.0  6.00   6.0   6.00    6.0
Zyria     10.0   5.900000   0.737865  5.0  5.25   6.0   6.00    7.0
Zyriah     9.0   6.444444   1.666667  5.0  5.00   6.0   7.00   10.0

[17632 rows x 8 columns]

## Deleting: Iris
Referencias:
* [fillna](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html)

56. Import the dataset from this [address](https://facuzeta.github.io/udesa/01_programacion/guias/datasets/iris.data).

57. Assign it to a variable called iris

In [236]:
iris = pd.read_csv('Data/iris.data', header=None)
iris.head()

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

58. Create columns for the dataset

In [237]:
# 1. sepal_length (in cm)
# 2. sepal_width (in cm)
# 3. petal_length (in cm)
# 4. petal_width (in cm)
# 5. class

iris.columns = [['sepal_length (in cm)','sepal_width (in cm)', 'petal_length (in cm)','petal_width (in cm)','class']]

59.  Is there any missing value in the dataframe?

In [238]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   (sepal_length (in cm),)  150 non-null    float64
 1   (sepal_width (in cm),)   150 non-null    float64
 2   (petal_length (in cm),)  150 non-null    float64
 3   (petal_width (in cm),)   150 non-null    float64
 4   (class,)                 150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

60.  Lets set the values of the rows 10 to 29 of the column 'petal_length' to NaN

In [239]:
iris.iloc[10:29, 2]=np.NaN

In [240]:
iris.sample(5)

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm),class
130,7.4,2.8,6.1,1.9,Iris-virginica
39,5.1,3.4,1.5,0.2,Iris-setosa
83,6.0,2.7,5.1,1.6,Iris-versicolor
99,5.7,2.8,4.1,1.3,Iris-versicolor
38,4.4,3.0,1.3,0.2,Iris-setosa

61. Good, now lets substitute the NaN values to 1.0

In [241]:
iris.fillna(1, inplace = True)

62. Now let's delete the column class

In [242]:
iris.drop('class', axis=1)

/Users/csuarezgurruchaga/opt/anaconda3/envs/UDESA01/lib/python3.6/site-packages/pandas/core/generic.py:3889: PerformanceWarning: dropping on a non-lexsorted multi-index without a level parameter may impact performance.
  obj = obj._drop_axis(labels, axis, level=level, errors=errors)

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
0,5.1,3.5,1.4,0.2
1,4.9,3.0,1.4,0.2
2,4.7,3.2,1.3,0.2
3,4.6,3.1,1.5,0.2
4,5.0,3.6,1.4,0.2
...,...,...,...,...
145,6.7,3.0,5.2,2.3
146,6.3,2.5,5.0,1.9
147,6.5,3.0,5.2,2.0
148,6.2,3.4,5.4,2.3
149,5.9,3.0,5.1,1.8

63.  Set the first 3 rows as NaN

In [243]:
iris.iloc[0:3]=np.NaN
iris.head()

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm),class
0,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN
3,4.6,3.1,1.5,0.2,Iris-setosa
4,5.0,3.6,1.4,0.2,Iris-setosa

64.  Delete the rows that have NaN

In [246]:
iris.dropna(inplace = True)
iris.head()

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm),class
3,4.6,3.1,1.5,0.2,Iris-setosa
4,5.0,3.6,1.4,0.2,Iris-setosa
5,5.4,3.9,1.7,0.4,Iris-setosa
6,4.6,3.4,1.4,0.3,Iris-setosa
7,5.0,3.4,1.5,0.2,Iris-setosa

65. Reset the index so it begins with 0 again

In [248]:
iris.reset_index(inplace = True, drop = True)
iris.head()

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm),class
0,4.6,3.1,1.5,0.2,Iris-setosa
1,5.0,3.6,1.4,0.2,Iris-setosa
2,5.4,3.9,1.7,0.4,Iris-setosa
3,4.6,3.4,1.4,0.3,Iris-setosa
4,5.0,3.4,1.5,0.2,Iris-setosa

## Bonus:
Si quiere mas ejercicios visitar:
* https://github.com/ajcr/100-pandas-puzzles/blob/master/100-pandas-puzzles.ipynb
* https://www.machinelearningplus.com/python/101-pandas-exercises-python/